import Kyobo
from Kyobo import kyobo
from Yes24 import yes24
from Aladin import aladin
from DriverManager import driverManager

class tickets:
    def getTicket(self):
        testList_12124 = [
            [aladin, '', 0, 0, '넌 대체 몇 년째 영어 공부를 하고 있는 거니?'],
            [yes24, '', 0, 0, '이토록 평범한 미래'],
            [kyobo, '', 0, 0, '나도 모르는 내 마음의 심리법칙'],
            [aladin, '', 0, 0, '세상의 마지막 기차역'],
            [yes24, '', 0, 0, '코스모스'],
            [kyobo, '', 0, 0, '열혈강호 87'],
            # [yes24_v5, '유럽', 1, -2, '마음까지 따듯해지는 북유럽 스타일 손뜨개 소품'],
            # [aladin_v2, '요리', 7, -2, 'Why? 역사 속 음식과 요리'],
            # [aladin_v2, '유럽여행', 5, -2, '북유럽 셀프 트래블'],
            # [ypbook_v2, '유럽여행', 3, -2, '우리 아이 첫 유럽 미술관 여행'],
            # [ypbook_v2, '영어회화', 3, -2, '영어회화공식 231+54 : 기본'],
            # [kyobo_v2, '유럽여행', 5, -2, '[국내도서] 현지에서 바로 쓰는 유럽 5개국 여행회화'],
            # [kyobo_v2, '영어회화', 5, -2, '[국내도서] 야나두 영어회화'],
        ]
        testList_12124 = [
            [aladin, '', 0, 0, '넌 대체 몇 년째 영어 공부를 하고 있는 거니?'],
            [yes24, '', 0, 0, '이토록 평범한 미래'],
            [kyobo, '', 0, 0, '나도 모르는 내 마음의 심리법칙'],
            [aladin, '', 0, 0, '세상의 마지막 기차역'],
            [yes24, '', 0, 0, '코스모스'],
            [kyobo, '', 0, 0, '열혈강호 87'],
        ]
        testList_12124 = [

            [aladin, '', 0, 0, '백년 허리 2 : 치료편'],
            [aladin, '', 0, 0, '생각하라 그리고 부자가 되어라'],
            [aladin, '', 0, 0, '넌 대체 몇 년째 영어 공부를 하고 있는 거니?'],
            [kyobo, '', 0, 0, '나도 모르는 내 마음의 심리법칙'],
            [aladin, '', 0, 0, '세상의 마지막 기차역'],
            [kyobo, '', 0, 0, '열혈강호 87'], [yes24, '', 0, 0, '이토록 평범한 미래'],
            [yes24, '', 0, 0, '코스모스'],
        ]
        return testList_12124